СРО_Копия/src/Documents/ОтчетОПерсональномСоставеКооператива/ОтчетОПерсональномСоставеКооператива.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОПерсональномСоставеКооператива</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КПК</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>EnumRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеНаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетныйГод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПКПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПКИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПКОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПККраткоеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияПодписавшегоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПодписавшегоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоПодписавшегоЛица</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеНаправления</name>
    <type>
      <types>EnumRef.ОснованияНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходящаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДокумента</name>
    <type>
      <types>EnumRef.КодДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПредоставившаяОтчет</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТРДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТРНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительноеПисьмо_ФИОРуководителяКПК</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СведенияОФизЛицах</name>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипФизЛица</name>
      <type>
        <types>EnumRef.СРО_ТипФизЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Гражданство</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументУдостоверяющийЛичность_Вид</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументУдостоверяющийЛичность_СерияНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументУдостоверяющийЛичность_КемВыдан</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументУдостоверяющийЛичность_ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументУдостоверяющийЛичность_КодПодразделения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресМестаРегистрации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитыДокументаНаПравоНахожденияВРФ</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресМестаЖительства</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РешениеОПолномочиях_Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РешениеОПолномочиях_Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоРождения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностиПоСовместительствуВФинансовыхОрганизациях</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Иное_Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СНИЛС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформацияЛиц</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Индекс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСубъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеСубъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Район</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Улица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Корпус_Строение_Квартира</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеАдреса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтактнойИнформации</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СРО_Копия/src/Enums/ВидыОтчетов/ВидыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтчетов</name>
  <enumValues>
    <name>Квартал1</name>
  </enumValues>
  <enumValues>
    <name>Квартал2</name>
  </enumValues>
  <enumValues>
    <name>Квартал3</name>
  </enumValues>
  <enumValues>
    <name>Годовой90Дней</name>
  </enumValues>
  <enumValues>
    <name>Годовой30Дней</name>
  </enumValues>
  <enumValues>
    <name>ДанныеНаДату</name>
  </enumValues>
  <enumValues>
    <name>НаНерегулярнойОснове</name>
    <comment>Для документа &quot;ОтчетОПерсональномСоставеКооператива&quot;</comment>
  </enumValues>
  <enumValues>
    <name>Годовой</name>
    <comment>Для документа &quot;ОтчетОПерсональномСоставеКооператива&quot;</comment>
  </enumValues>
</mdclass:Enum>

СРО_Копия/src/Enums/КодДокумента/КодДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодДокумента</name>
  <enumValues>
    <name>ОКУД_0420820_21631</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21632</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21633</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21634</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_2164</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21641</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21642</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_21644</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420820_2165</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21632</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21633</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21634</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_21643</name>
  </enumValues>
  <enumValues>
    <name>ОКУД_0420821_2165</name>
  </enumValues>
  <enumValues>
    <name>КодНеОпределен</name>
  </enumValues>
  <enumValues>
    <name>БО_2163</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_2163</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_2164</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_21641</name>
  </enumValues>
  <enumValues>
    <name>ОКУД0420001_2165</name>
  </enumValues>
</mdclass:Enum>

СРО_Копия/src/Enums/СРО_ТипФизЛица/СРО_ТипФизЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СРО_ТипФизЛица</name>
  <enumValues>
    <name>ВходитВЕдиноличныйИсполнительныйОрган</name>
  </enumValues>
  <enumValues>
    <name>ВходитВПравление</name>
  </enumValues>
  <enumValues>
    <name>ВходитВКонтрольноРевизионныйОрган</name>
  </enumValues>
  <enumValues>
    <name>ВходитВКомитетПоЗаймам</name>
  </enumValues>
  <enumValues>
    <name>ВходитВИнойОрганКооператива</name>
  </enumValues>
  <enumValues>
    <name>ОтветственныйЗаПравилаВнутреннееКонтроля</name>
  </enumValues>
  <enumValues>
    <name>ЛицоНаКотороеВозложеноВедениеБухУчета</name>
  </enumValues>
</mdclass:Enum>

СРО_Копия/src/Documents/ОтчетОПерсональномСоставеКооператива/Forms/ФормаДокумента/Module.bsl
&НаСервере
Функция ПериодОтчетаГодовой()
	Если Объект.ВидОтчета = Перечисления.ВидыОтчетов.Годовой30Дней ИЛИ Объект.ВидОтчета = Перечисления.ВидыОтчетов.Годовой90Дней Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Для документа Отчет о персональном составе кооператива
&НаСервереБезКонтекста

Функция ПоказатьПоле_ОтчетныйГод(КодДокумента, ВидОтчета)   
	
	Возврат (КодДокумента = Перечисления.КодДокумента.ОКУД_0420821_21634 И ВидОтчета = Перечисления.ВидыОтчетов.Годовой)
		ИЛИ КодДокумента <> Перечисления.КодДокумента.ОКУД_0420821_21634;

КонецФункции 


Функция ЭтоКод2_16_3_4(КодДокумента)   
	
	Возврат КодДокумента = Перечисления.КодДокумента.ОКУД_0420821_21634;

КонецФункции 



&НаКлиенте
Процедура УстановитьВидимостьИЗаголовкиРеквизитов()
	
	КодДокумента2_16_3_4 = ЭтоКод2_16_3_4(Объект.КодДокумента);
	
	Элементы.ФизЛицо_ФИО.Видимость = НЕ Строка(Объект.КодДокумента) = "2.16.3.2";
	Элементы.ФизЛицо_Фамилия.Видимость = Строка(Объект.КодДокумента) = "2.16.3.2";
	Элементы.ФизЛицо_Имя.Видимость = Строка(Объект.КодДокумента) = "2.16.3.2";
	Элементы.ФизЛицо_Отчество.Видимость = Строка(Объект.КодДокумента) = "2.16.3.2";
	Элементы.ФизЛицо_МестоРождения.Видимость = НЕ Строка(Объект.КодДокумента) = "2.16.3.2";
	Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_КодПодразделения.Видимость = Строка(Объект.КодДокумента) = "2.16.3.2";  	
	Элементы.ФизЛицо_РеквизитыДокументаНаПравоНахожденияВРФ.Видимость = Строка(Объект.КодДокумента) = "2.16.3.2";		
	Элементы.ФизЛицо_РешениеОПолномочиях_Дата.Видимость = Строка(Объект.КодДокумента) = "2.16.3.2"; 	
	
	
	// для 2.16.3.4
	Элементы.ОтчетныйГод.Видимость = ПоказатьПоле_ОтчетныйГод(Объект.КодДокумента, Объект.ВидОтчета);	 	
	Элементы.Раздел1.Видимость = НЕ КодДокумента2_16_3_4;
	
	Если КодДокумента2_16_3_4 Тогда
		Элементы.Раздел2.Заголовок = "Разделы";
		Элементы.ФизЛицо_РешениеОПолномочиях_Номер.Заголовок = "Дата и номер решения (документа), предоставляющего полномочия";
	КонецЕсли;    
	
	Элементы.СопроводительноеПисьмо_ФИОРуководителяКПК.Видимость = КодДокумента2_16_3_4; 
	
	Элементы.ФамилияПодписавшегоЛица.Видимость = НЕ КодДокумента2_16_3_4;
	Элементы.ИмяПодписавшегоЛица.Видимость = НЕ КодДокумента2_16_3_4;
	Элементы.ОтчествоПодписавшегоЛица.Видимость = НЕ КодДокумента2_16_3_4;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьИЗаголовкиРеквизитов();

КонецПроцедуры



//&НаСервере
//Процедура ОбновитьРеквизитыНаФорме()
//	КПК = Объект.КПК;
//	ПолноеНаименованиеКПК = КПК.НаименованиеПолное;
//	КраткоеНаименованиеКПК = КПК.НаименованиеКраткое;
//	ИННКПК = КПК.ИНН;
//	ОРГНКПК = КПК.ОГРН;
//	ДатаСозданияКПК = КПК.ДатаРегистрацииКПК;
//	
//	// 6. Место нахождения
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресМестонахожденияКонтрагента;	
//	МестоНахожденияКПК = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	// 7. Адрес фактического местонахождения	
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактическийАдресКонтрагента;	
//	АдресФактическогоМестонахождения = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	
//	// 8. Адрес для почтовой корреспонденции
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента;	
//	ПочтовыйАдресКПК = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	// 9. Номер телефона
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Телефон;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;	
//	НомерТелефона = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);	
//	
//	// 10. Номер факса 	
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Факс;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФаксКонтрагента;	
//	НомерФакса = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	// 11. АдресЭлектроннойПочты

//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;	
//	АдресЭлектроннойПочты = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);	
//	     
//	// 12. Адрес сайта в интернете 	
//	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
//	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ВебСайтКонтрагента;	
//	АдресСайта = СРО_ОбщегоНазначенияСервер.ПолучитьПредставлениеКонстактноИнформации(КПК, ТипКонтактнойИнформации, ВидКонтактнойИнформации);
//	
//	// 13. Наименование организации, представившей отчет
//	
//	НаименованиеОрганизацииПредоставившейОтчет = СокрЛП(Объект.Организация.НаименованиеПолное);

//	
//	
//КонецПроцедуры


&НаКлиенте
Процедура КПКПриИзменении(Элемент)
	//ОбновитьРеквизитыНаФорме();

	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьДеревоТиповФизЛиц();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере

Процедура ЗаполнитьДеревоТиповФизЛиц()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица КАК ТипОргана,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ФИО КАК ФИО,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Должность КАК Должность,
	               |	ВЫБОР
	               |		КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВЕдиноличныйИсполнительныйОрган)
	               |			ТОГДА 1
	               |		КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВПравление)
	               |			ТОГДА 2
	               |		КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВКонтрольноРевизионныйОрган)
	               |			ТОГДА 3
	               |		КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВКомитетПоЗаймам)
	               |			ТОГДА 4
	               |		КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВИнойОрганКооператива)
	               |			ТОГДА 5
	               |		КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ОтветственныйЗаПравилаВнутреннееКонтроля)
	               |			ТОГДА 6
	               |		КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ЛицоНаКотороеВозложеноВедениеБухУчета)
	               |			ТОГДА 7
	               |		ИНАЧЕ 100
	               |	КОНЕЦ КАК ПорядокСортировкиПоТипуФизЛица,
	               |	ВЫБОР
	               |		КОГДА &Это2_16_3_4
	               |			ТОГДА ВЫБОР
	               |					КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВЕдиноличныйИсполнительныйОрган)
	               |						ТОГДА ""Раздел 1. Сведения о единоличном исполнительном органе КПК""
	               |					КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВПравление)
	               |						ТОГДА ""Раздел 2. Сведения о персональном составе правления КПК""
	               |					КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВКонтрольноРевизионныйОрган)
	               |						ТОГДА ""Раздел 3. Сведения о персональном составе контрольно-ревизионного органа КПК""
	               |					КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВКомитетПоЗаймам)
	               |						ТОГДА ""Раздел 4. Сведения о персональном составе комитета по займам КПК (при наличии)""
	               |					КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ВходитВИнойОрганКооператива)
	               |						ТОГДА ""Раздел 5. Сведения о персональном составе иных органов КПК (при наличии)""
	               |					КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ОтветственныйЗаПравилаВнутреннееКонтроля)
	               |						ТОГДА ""Раздел 6. Сведения о специальном должностном лице, ответственном з ареализацию правил внутреннего контроля ПОД/ФТ""
	               |					КОГДА ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица = ЗНАЧЕНИЕ(перечисление.СРО_ТипФизЛица.ЛицоНаКотороеВозложеноВедениеБухУчета)
	               |						ТОГДА ""Раздел 7. Сведения о должностном лице, на которое возлагается ведение бухгалтерского учета в КПК""
	               |				КОНЕЦ
	               |		ИНАЧЕ ПРЕДСТАВЛЕНИЕССЫЛКИ(ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица)
	               |	КОНЕЦ КАК ПредставлениеТипаОргана,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ИдентификаторСтроки КАК ИдентификаторСтроки,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Иное_Должность КАК Иное_Должность
	               |ИЗ
	               |	Документ.ОтчетОПерсональномСоставеКооператива.СведенияОФизЛицах КАК ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах
	               |ГДЕ
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Ссылка = &Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядокСортировкиПоТипуФизЛица
	               |ИТОГИ ПО
	               |	ТипОргана";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Это2_16_3_4", Объект.КодДокумента = Перечисления.КодДокумента.ОКУД_0420821_21634);
	
	ВремДеревоТипов = РеквизитФормыВЗначение("ДеревоПоТипамФизЛиц");
	
	ВыборкаПоТипу = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоТипу.Следующий() Цикл
		
		СтрокаТипаДерева = ВремДеревоТипов.Строки.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТипаДерева, ВыборкаПоТипу);
		
		Выборка = ВыборкаПоТипу.Выбрать();
		
		Пока Выборка.Следующий() Цикл  			
			СтрокаДерева = СтрокаТипаДерева.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, Выборка);	
			
		КонецЦикла; 		
	КонецЦикла; 
	
	ЗначениеВРеквизитФормы(ВремДеревоТипов, "ДеревоПоТипамФизЛиц");
	
КонецПроцедуры





&НаСервере
Процедура ВывестиТаблицуПоказателей(Раздел, ТабличныйДокумент)
	
	// очищаем таблиынй дкоумент на в закладке
	ТабличныйДокумент.Очистить();
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");	
	Макет = ТекОбъект.ПолучитьМакет("ТаблицаПоказателей");
	
	ОбластьШапка = Макет.получитьОбласть("Шапка");
	ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапки");
	ОбластьСтрока = Макет.получитьОбласть("Строка");


	ВТысРублей = "тыс.руб.";

	
	// выбираем нужные разделы и показатели
	Если Раздел = "Раздел2" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел2;
	ИначеЕсли Раздел = "Раздел3" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел3;
	ИначеЕсли Раздел = "Раздел4" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел4;			
		ВТысРублей = "";
		
	ИначеЕсли Раздел = "Раздел5" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел5;	                    		
		ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел5");
		ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел5"); 	
	ИначеЕсли Раздел = "Раздел6" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел6;	                    		
		ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел6");
		ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел6"); 
		ВТысРублей = "";
		
	ИначеЕсли Раздел = "Раздел7" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел7;	                    		
		ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел7_8");
		ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел7_8"); 	
		 
	ИначеЕсли Раздел = "Раздел8" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел8;	                    		
		ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел7_8");
		ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел7_8"); 	
		
	ИначеЕсли Раздел = "Раздел9" тогда		        		
		ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел9");
		ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел9"); 	
		ВТысРублей = "";
		
	ИначеЕсли Раздел = "Раздел10" тогда		        		
		ОбластьЗаголовкиШапки = Макет.получитьОбласть("ЗаголовкиШапкиРаздел10");
		ОбластьСтрока = Макет.получитьОбласть("СтрокаРаздел10"); 	
		ОбластьЗаголовок = Макет.получитьОбласть("СтрокаРаздел10Заголовок"); 	
		ВТысРублей = "";    
		 		
	ИначеЕсли Раздел = "Раздел11" тогда
		ГруппаРазделов = Справочники.Разделы.Раздел11;	
		ВТысРублей = "";     
	КонецЕсли;
	
	
	Если Раздел = "Раздел9" тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаПоказателей.КодРаздела КАК КодРаздела,
		|	ОтчетностьКПКТаблицаПоказателей.ВидАктивов КАК ВидАктивов,
		|	ОтчетностьКПКТаблицаПоказателей.СуммаРазмещаемыхСредств КАК СуммаРазмещаемыхСредств,
		|	ОтчетностьКПКТаблицаПоказателей.НаименованиеКредитногоРейтинговогоАгенства КАК НаименованиеКредитногоРейтинговогоАгенства,
		|	ОтчетностьКПКТаблицаПоказателей.УровеньКредитногоРейтинга КАК УровеньКредитногоРейтинга
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаПоказателейРаздел9 КАК ОтчетностьКПКТаблицаПоказателей
		|ГДЕ
		|	ОтчетностьКПКТаблицаПоказателей.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетностьКПКТаблицаПоказателей.ПорядокСортировки";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
	ИначеЕсли Раздел = "Раздел10" тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка КАК Ссылка,
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.НомерСтроки КАК НомерСтроки,
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ДатаНомерДоговора КАК ДатаНомерДоговора,
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ДатаНомерПротокола КАК ДатаНомерПротокола,
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.РазмерОбязательствНаМоментЗаключенияДоговора КАК РазмерОбязательствНаМоментЗаключенияДоговора,
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.РазмерОбязательствНаКонецОтчетногоПериода КАК РазмерОбязательствНаКонецОтчетногоПериода,
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.УсловиеИсполненияОбязательств КАК УсловиеИсполненияОбязательств,
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.СрокИсполненияОбязательств КАК СрокИсполненияОбязательств,
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.ВидДоговора КАК ВидДоговора,
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаДоговоровОдобренныхОбщимСобранием КАК ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием
		|ГДЕ
		|	ОтчетностьКПКТаблицаДоговоровОдобренныхОбщимСобранием.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетностьКПКТаблицаПоказателей.Раздел.КодРаздела КАК РазделКод,
		|	ОтчетностьКПКТаблицаПоказателей.Раздел.ПолноеНаименование КАК РазделПолноеНаименование,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель1 КАК ЗначениеПоказателя,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель2 КАК Показатель2,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель3 КАК Показатель3,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель4 КАК Показатель4,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель5 КАК Показатель5,
		|	ОтчетностьКПКТаблицаПоказателей.Показатель6 КАК Показатель6,
		|	ОтчетностьКПКТаблицаПоказателей.Раздел.Код КАК РазделКод1
		|ИЗ
		|	Документ.ОтчетностьКПК.ТаблицаПоказателей КАК ОтчетностьКПКТаблицаПоказателей
		|ГДЕ
		|	ОтчетностьКПКТаблицаПоказателей.Ссылка = &Ссылка
		|	И ОтчетностьКПКТаблицаПоказателей.Раздел В ИЕРАРХИИ(&ГруппаРазделов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтчетностьКПКТаблицаПоказателей.Раздел.ПорядокСортировки";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		Запрос.УстановитьПараметр("ГруппаРазделов", ГруппаРазделов);
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;		
	КонецЕсли; 	
	
	Если Раздел = "Раздел9" Тогда
		ОбластьШапка.Параметры.НазваниеРаздела = "Раздел IX. Данные о размещении средств резервных фондов";  		
	ИначеЕсли Раздел = "Раздел10" тогда      
		ОбластьШапка.Параметры.НазваниеРаздела = "Раздел X. Информация о договорах, одобренных общим собранием";	
	Иначе	
		ОбластьШапка.Параметры.НазваниеРаздела = ГруппаРазделов.ПолноеНаименование;
	КонецЕсли;
	ОбластьШапка.Параметры.ВТысРублей = ВТысРублей;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	ТабличныйДокумент.Вывести(ОбластьЗаголовкиШапки);   	
	

	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Раздел = "Раздел9" Тогда
			ОбластьСтрока.Параметры.КодРаздела = Выборка.КодРаздела;
			ОбластьСтрока.Параметры.ВидАктивов = Выборка.ВидАктивов;
			ОбластьСтрока.Параметры.СуммаРазмещаемыхСредств = Выборка.СуммаРазмещаемыхСредств;
			ОбластьСтрока.Параметры.НаименованиеКредитногоРейтинговогоАгенства = Выборка.НаименованиеКредитногоРейтинговогоАгенства;
			ОбластьСтрока.Параметры.УровеньКредитногоРейтинга = Выборка.УровеньКредитногоРейтинга; 			
			
		ИначеЕсли Раздел = "Раздел10" Тогда
			
			Если СокрЛП(Выборка.Комментарий) <> "" тогда
				Если Выборка.ВидДоговора = "ДоговорыЗайма" Тогда
					ОбластьЗаголовок.Параметры.НомерСтроки = "1";	
				Иначе
					ОбластьЗаголовок.Параметры.НомерСтроки = "2";		
				КонецЕсли;
				
				ОбластьЗаголовок.Параметры.Комментарий = Выборка.Комментарий;
							
				ТабличныйДокумент.Вывести(ОбластьЗаголовок); 	
				Продолжить;
			КонецЕсли;
			
			ОбластьСтрока.Параметры.НомерСтроки	 = "-";
			ОбластьСтрока.Параметры.ДатаНомерДоговора		 = Выборка.ДатаНомерДоговора;
			ОбластьСтрока.Параметры.ДатаНомерПротокола		 = Выборка.ДатаНомерПротокола;						
			ОбластьСтрока.Параметры.РазмерОбязательствНаМоментЗаключенияДоговора	 = Выборка.РазмерОбязательствНаМоментЗаключенияДоговора;
			ОбластьСтрока.Параметры.РазмерОбязательствНаКонецОтчетногоПериода	 = Выборка.РазмерОбязательствНаКонецОтчетногоПериода;
			ОбластьСтрока.Параметры.УсловиеИсполненияОбязательств		 = Выборка.УсловиеИсполненияОбязательств;
			ОбластьСтрока.Параметры.СрокИсполненияОбязательств		 = Выборка.СрокИсполненияОбязательств;	
					
		Иначе	

			Поз = СтрНайти(Выборка.РазделКод, "_");
			
			Если Поз > 0 Тогда     			
				ОбластьСтрока.Параметры.КодРаздела = Сред(Выборка.РазделКод, Поз + 1);
			Иначе	
				ОбластьСтрока.Параметры.КодРаздела = СокрЛП(Выборка.РазделКод);
			КонецЕсли;
			
			ОбластьСтрока.Параметры.НаименованиеПоказателя = Выборка.РазделПолноеНаименование;
			ОбластьСтрока.Параметры.ЗначениеПоказателя = ?(Выборка.ЗначениеПоказателя=-99999, "Х", Выборка.ЗначениеПоказателя);
			
			Если Раздел = "Раздел5"
				ИЛИ Раздел = "Раздел6" 
				ИЛИ Раздел = "Раздел7"
				ИЛИ Раздел = "Раздел8" Тогда
				ОбластьСтрока.Параметры.Показатель2 = ?(Выборка.Показатель2 =-99999, "Х", Выборка.Показатель2);
				ОбластьСтрока.Параметры.Показатель3 = ?(Выборка.Показатель3 =-99999, "Х", Выборка.Показатель3);
				Если Раздел = "Раздел5" Тогда
					ОбластьСтрока.Параметры.Показатель4 = ?(Выборка.Показатель4 =-99999, "Х", Выборка.Показатель4);  	
				ИначеЕсли Раздел = "Раздел7" ИЛИ Раздел = "Раздел8" Тогда
					ОбластьСтрока.Параметры.Показатель4 = ?(Выборка.Показатель4 =-99999, "Х", Выборка.Показатель4);  	
					ОбластьСтрока.Параметры.Показатель5 = ?(Выборка.Показатель5 =-99999, "Х", Выборка.Показатель5);  	
					ОбластьСтрока.Параметры.Показатель6 = ?(Выборка.Показатель6 =-99999, "Х", Выборка.Показатель6);  	
		
				КонецЕсли;			
				
			КонецЕсли;
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла;                                                  
	
	
	
	
	
//	НайденныеСтроки
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
		
	//Если ТекущаяСтраница.Имя = "Раздел2" Тогда
	//	ВывестиТаблицуПоказателей("Раздел2", ТаблицаПоказателей);
	//	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел3" Тогда
	//	ВывестиТаблицуПоказателей("Раздел3", ТаблицаПоказателей);	
	//
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел4" Тогда
	//	ВывестиТаблицуПоказателей("Раздел4", ТаблицаПоказателей);	
	//	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел5" Тогда
	//	ВывестиТаблицуПоказателей("Раздел5", ТаблицаПоказателей);	
	//	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел6" Тогда
	//	ВывестиТаблицуПоказателей("Раздел6", ТаблицаПоказателей);
	//	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел7" Тогда
	//	ВывестиТаблицуПоказателей("Раздел7", ТаблицаПоказателей);	
	//	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел8" Тогда
	//	ВывестиТаблицуПоказателей("Раздел8", ТаблицаПоказателей);
	//	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел9" Тогда
	//	ВывестиТаблицуПоказателей("Раздел9", ТаблицаПоказателей);
	//	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел10" Тогда
	//	ВывестиТаблицуПоказателей("Раздел10", ТаблицаПоказателей);	
	//	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел11" Тогда
	//	ВывестиТаблицуПоказателей("Раздел11", ТаблицаПоказателей);	
	//	
	//ИначеЕсли ТекущаяСтраница.Имя = "Раздел8" Тогда
	//	ВывестиТаблицуПоказателей("Раздел8", ТаблицаПоказателей);		
	//	
		
	//КонецЕсли;
	
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьРеквизитыПоФизЛицу(ИдентификаторСтроки)
	
	Запрос = Новый Запрос;   	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Фамилия КАК ФизЛицо_Фамилия,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Имя КАК ФизЛицо_Имя,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Отчество КАК ФизЛицо_Отчество,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Должность КАК ФизЛицо_Должность,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ТипФизЛица КАК ФизЛицо_ТипФизЛица,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ДатаРождения КАК ФизЛицо_ДатаРождения,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Гражданство КАК ФизЛицо_Гражданство,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ДокументУдостоверяющийЛичность_Вид КАК ФизЛицо_ДокументУдостоверяющийЛичность_Вид,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ДокументУдостоверяющийЛичность_СерияНомер КАК ФизЛицо_ДокументУдостоверяющийЛичность_СерияНомер,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ДокументУдостоверяющийЛичность_КемВыдан КАК ФизЛицо_ДокументУдостоверяющийЛичность_КемВыдан,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ДокументУдостоверяющийЛичность_ДатаВыдачи КАК ФизЛицо_ДокументУдостоверяющийЛичность_ДатаВыдачи,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ДокументУдостоверяющийЛичность_КодПодразделения КАК ФизЛицо_ДокументУдостоверяющийЛичность_КодПодразделения,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.АдресМестаРегистрации КАК ФизЛицо_АдресМестаРегистрации,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.РеквизитыДокументаНаПравоНахожденияВРФ КАК ФизЛицо_РеквизитыДокументаНаПравоНахожденияВРФ,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.АдресМестаЖительства КАК ФизЛицо_АдресМестаЖительства,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ИНН КАК ФизЛицо_ИНН,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.РешениеОПолномочиях_Дата КАК ФизЛицо_РешениеОПолномочиях_Дата,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.РешениеОПолномочиях_Номер КАК ФизЛицо_РешениеОПолномочиях_Номер,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ФИО КАК ФизЛицо_ФИО,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.МестоРождения КАК ФизЛицо_МестоРождения,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ДолжностиПоСовместительствуВФинансовыхОрганизациях КАК ФизЛицо_ДолжностиПоСовместительствуВФинансовыхОрганизациях,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Иное_Должность КАК ФизЛицо_ИноеДолжность,
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.СНИЛС КАК ФизЛицо_СНИЛС
	               |ИЗ
	               |	Документ.ОтчетОПерсональномСоставеКооператива.СведенияОФизЛицах КАК ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах
	               |ГДЕ
	               |	ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.Ссылка = &Ссылка
	               |	И ОтчетОПерсональномСоставеКооперативаСведенияОФизЛицах.ИдентификаторСтроки = &ИдентификаторСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", ИдентификаторСтроки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
		
	КонецЕсли;
	
	ВыводитьДолжностьИное = Ложь;
	Константа_ДолжностьИное = Константы.СРО_Должность_Иное.Получить();   	
	
	Если ЗначениеЗаполнено(Константа_ДолжностьИное) Тогда
		Если ФизЛицо_Должность = Константа_ДолжностьИное Тогда			
			ВыводитьДолжностьИное = Истина;
		КонецЕсли;
	КонецЕсли;	
		
	Элементы.ФизЛицо_ИноеДолжность.Видимость = ВыводитьДолжностьИное;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьПрефикРеквизитов(ТипФизЛица)
	
	Префикс = "";
			
	Если Строка(Объект.КодДокумента) = "2.16.3.2" Тогда
		
		Если ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВЕдиноличныйИсполнительныйОрган Тогда
			Префикс = "2.1";
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВПравление Тогда
			Префикс = "2.2"; 	
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВКонтрольноРевизионныйОрган Тогда
			Префикс = "2.3"; 		
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВКомитетПоЗаймам Тогда
			Префикс = "2.4"; 			
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВИнойОрганКооператива Тогда
			Префикс = "2.5"; 				
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ОтветственныйЗаПравилаВнутреннееКонтроля Тогда
			Префикс = "2.6"; 					
		КонецЕсли;
		
	ИначеЕсли Строка(Объект.КодДокумента) = "2.16.3.3" Тогда
		
		Если ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВЕдиноличныйИсполнительныйОрган Тогда
			Префикс = "1";
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВПравление Тогда
			Префикс = "2"; 	
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВКонтрольноРевизионныйОрган Тогда
			Префикс = "3"; 		
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВКомитетПоЗаймам Тогда
			Префикс = "4"; 			
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ВходитВИнойОрганКооператива Тогда
			Префикс = "5"; 				
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ОтветственныйЗаПравилаВнутреннееКонтроля Тогда
			Префикс = "6"; 					
			
		ИначеЕсли ТипФизЛица = Перечисления.СРО_ТипФизЛица.ЛицоНаКотороеВозложеноВедениеБухУчета Тогда
			Префикс = "7"; 						
		КонецЕсли;
	КонецЕсли;
		
	Возврат Префикс;	
	
КонецФункции

	
&НаКлиенте
Процедура УстановитьПрефиксРеквизитовФизЛица(ТипФизЛица)
	
	Префикс = ПолучитьПрефикРеквизитов(ТипФизЛица);   	
			
	Если Строка(Объект.КодДокумента) = "0420821 2.16.3.23"  Тогда  				
		
		Элементы.ФизЛицо_Фамилия.Заголовок = Префикс + ".1 Фамилия";
		Элементы.ФизЛицо_Имя.Заголовок = Префикс + ".1 Имя";
		Элементы.ФизЛицо_Отчество.Заголовок = Префикс + ".1 Отчество";
		Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_КодПодразделения.Заголовок = Префикс + ".4 Код подразделения"; 	
		Элементы.ФизЛицо_ДатаРождения.Заголовок = Префикс + ".2 Дата рождения";
		Элементы.ФизЛицо_Гражданство.Заголовок = Префикс + ".3 Гражданство";
		Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_Вид.Заголовок = Префикс + ".4 Вид документа";
		Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_СерияНомер.Заголовок = Префикс + ".4 Серия и номер документа";
		Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_КемВыдан.Заголовок = Префикс + ".4 Кем выдан документ";
		Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_ДатаВыдачи.Заголовок = Префикс + ".4 Дата выдачи документа";
		Элементы.ФизЛицо_АдресМестаРегистрации.Заголовок = Префикс + ".5 Адрес места регистрации";		
		Элементы.ФизЛицо_АдресМестаЖительства.Заголовок = Префикс + ".6 Адрес места жительства";
		Элементы.ФизЛицо_РеквизитыДокументаНаПравоНахожденияВРФ.Заголовок = Префикс + ".5 Документ на право нахождение в РФ"; 
		
		Элементы.ФизЛицо_ИНН.Заголовок = Префикс + ".7 ИНН";	
		Элементы.ФизЛицо_Должность.Заголовок = Префикс + ".8 Наименование должности";	
		Элементы.ФизЛицо_РешениеОПолномочиях_Дата.Заголовок = Префикс + ".9 Дата решения о полномочиях";
		Элементы.ФизЛицо_РешениеОПолномочиях_Номер.Заголовок = Префикс + ".9 Номер решения о полномочиях";
		Элементы.ФизЛицо_ДолжностиПоСовместительствуВФинансовыхОрганизациях.Заголовок = Префикс + ".10 Должности, занимаемые по совместительству";  
		
	ИначеЕсли Строка(Объект.КодДокумента) = "0420821 2.16.3.3" 
		ИЛИ Строка(Объект.КодДокумента) = "0420821 2.16.3.4" Тогда  				
	
		Элементы.ФизЛицо_ФИО.Заголовок = Префикс + ".1 Фамилия, имя, отчество";
		Элементы.ФизЛицо_ДатаРождения.Заголовок = Префикс + ".1.1 Дата рождения";
		Элементы.ФизЛицо_Гражданство.Заголовок = Префикс + ".1.3 Гражданство";
		Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_Вид.Заголовок = Префикс + ".1.4 Документ";
		Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_СерияНомер.Заголовок = Префикс + ".1.4.1 Серия и номер";
		Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_КемВыдан.Заголовок = Префикс + ".1.4.3 Наименование органа";
		Элементы.ФизЛицо_ДокументУдостоверяющийЛичность_ДатаВыдачи.Заголовок = Префикс + ".1.4.2 Дата выдачи";
		Элементы.ФизЛицо_АдресМестаРегистрации.Заголовок = Префикс + ".1.5 Адрес регистрации по месту пребывания";
		Элементы.ФизЛицо_АдресМестаЖительства.Заголовок = Префикс + ".1.6 Адрес регистрации по месту жительства";
		Элементы.ФизЛицо_МестоРождения.Заголовок = Префикс + ".1.2 Место рождения";
		
		Элементы.ФизЛицо_ИНН.Заголовок = Префикс + ".1.7 ИНН";	
		Элементы.ФизЛицо_Должность.Заголовок = Префикс + ".1.8 Наименование должности";		
		Элементы.ФизЛицо_РешениеОПолномочиях_Номер.Заголовок = Префикс + ".1.9 Дата и номер решения о полномочиях";
		Элементы.ФизЛицо_ДолжностиПоСовместительствуВФинансовыхОрганизациях.Заголовок = Префикс + ".1.10 Должности, занимаемые по совместительству"; 		
	КонецЕсли;
	

	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПоТипамФизЛицПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ДеревоПоТипамФизЛиц.ТекущиеДанные.ФИО = "" Тогда
		Элементы.ГруппаПраво.Видимость = Ложь;
		
	Иначе	
		Элементы.ГруппаПраво.Видимость = Истина;	   		
		
		// установка видимости и заголовков реквизитов  		
		УстановитьПрефиксРеквизитовФизЛица(Элементы.ДеревоПоТипамФизЛиц.ТекущиеДанные.ТипОргана);
		
		// Заполнение реквизитов
		ИдентификаторСтроки = Элементы.ДеревоПоТипамФизЛиц.ТекущиеДанные.ИдентификаторСтроки;		
		ЗаполнитьРеквизитыПоФизЛицу(ИдентификаторСтроки);			
		
	КонецЕсли;
	
	

КонецПроцедуры
